1s/ERP/Conf/Documents/Лико_ЗаявкаНаДизайн.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Лико_ЗаявкаНаДизайн</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дизайнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаГотовности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРабот</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ВидыРаботДизайнера</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗаказа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ВидыЗаказов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Согласование</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_СпособыСогласования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусЗаявки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_СтатусыЗаявкиНаДизайн</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлощадкаУдалить</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказКлиента</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверкаКорректором</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФактическогоЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Спецификация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Спецификации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Площадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Площадки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Спецификация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_Спецификации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерВарианта</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Работы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Категория</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_КатегорииДизайна</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выполнена</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаДобавления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВыполнения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

1s/ERP/Conf/Enums/Лико_СтатусыЗаявкиНаДизайн.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_СтатусыЗаявкиНаДизайн</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создана</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаПодписи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Корректура</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/Лико_ТипыЭтикеток.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_ТипыЭтикеток</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЭТ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КЭ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кльр</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Комплект</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пакет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неопределено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФЛ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПП</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Documents/Лико_ЗаявкаНаДизайн/Forms/ФормаДокументаУпр/Ext/Form/Module.bsl
&НаСервере
Процедура КнопкаДизайнерПоТекущемуПользователюНаСервере()
	Объект.Дизайнер = ПараметрыСеанса.ТекущийПользователь;
	Если Объект.СтатусЗаявки=Перечисления.Лико_СтатусыЗаявкиНаДизайн.Создана Тогда
		Объект.СтатусЗаявки=Перечисления.Лико_СтатусыЗаявкиНаДизайн.ВРаботе;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаДизайнерПоТекущемуПользователю(Команда)
	КнопкаДизайнерПоТекущемуПользователюНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если РедактированиеСтрокиСпецификации Тогда
		  РедактированиеСтрокиСпецификации=Ложь;
		  Возврат;
		
	КонецЕсли;
	  
	СтандартнаяОбработка = Ложь;
	
	Спецификация=Элементы.Товары.ТекущиеДанные.Спецификация;
	СЗ = Новый СписокЗначений;
	
	Элемент.СписокВыбора.ЗагрузитьЗначения(ПолучитьСписокНоменклатуры(Спецификация));
	//ОписаниеОповещение=Новый ОписаниеОповещения("ТоварыНоменклатураНачалоВыбораЗавершение",ЭтаФорма);
	//ПоказатьВыборИзСписка(ОписаниеОповещение,СписокНоменклатуры,Элемент);
	
	
КонецПроцедуры

Функция ПолучитьСписокНоменклатуры(Спецификация) //+Лико m.shenderov 03/11/2019
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|ГДЕ
	|	ЗаказКлиентаТовары.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Лико_СпецификацииТовары.Номенклатура
	|ИЗ
	|	Справочник.Лико_Спецификации.Товары КАК Лико_СпецификацииТовары
	|ГДЕ
	|	Лико_СпецификацииТовары.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",?(ЗначениеЗаполнено(Спецификация),Спецификация,Объект.ЗаказКлиента ));
	СЗ = Новый СписокЗначений;
	
	//Сз.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Номенклатура"));
	СЗ=Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Номенклатура");
	Возврат СЗ;
	
	
КонецФункции //-Лико m.shenderov 03/11/2019 

&НаКлиенте
Процедура ТоварыНоменклатураНачалоВыбораЗавершение(Результат,Параметры)Экспорт //+Лико m.shenderov 03/11/2019
	
КонецПроцедуры //-Лико m.shenderov 03/11/2019



Процедура ЗаполнитьТаблицуТоварыДополнительнымиПолями() //+Лико m.shenderov 03/11/2019
	
	Для каждого Товар Из Объект.Товары Цикл
		Если ЗначениеЗаполнено(Товар.Спецификация) Тогда 
			ПараметрыШтампа = ПолучитьПараметрыШтампа(Товар.Спецификация, Товар.НомерВарианта);	
		    Товар.ОсновнойМатериал		=Товар.Спецификация.ОсновнойМатериал;
			Товар.АртикулШтампа			=?(ЗначениеЗаполнено(ПараметрыШтампа.ШтампВырубной),ПараметрыШтампа.ШтампВырубной.Артикул,Неопределено); 
			Если НЕ ЗначениеЗаполнено(Товар.НомерВарианта) Тогда
				Товар.НомерВарианта = 1;
			КонецЕсли;
		Иначе
			ПараметрыШтампа				=Объект.ЗаказКлиента;
			Товар.ОсновнойМатериал		=ПараметрыШтампа.ОсновнойМатериал;
			Товар.АртикулШтампа			=ПараметрыШтампа.ШтампВырубной.Артикул;
		КонецЕсли;
		Товар.ШтампВырубной			=ПараметрыШтампа.ШтампВырубной;
		Товар.ЭтикетокНаЛисте		=ПараметрыШтампа.ЭтикетокНаЛисте;	
		Товар.ШиринаРулона			=ПараметрыШтампа.Нарезка;
		Товар.Ручьи					=ПараметрыШтампа.Ручьи;
		Товар.Z						=ПараметрыШтампа.Z;
		// --> Начало Лико Митюшин МФМ 14.04.2021
		Товар.РучьиПечати			= ПараметрыШтампа.РучьиПечати;
		Товар.ЭтикетокНаЛистеПечати	= ПараметрыШтампа.ЭтикетокНаЛистеПечати;
		// <-- Конец Лико Митюшин МФМ 14.04.2021
	
	КонецЦикла;	
	
КонецПроцедуры //-Лико m.shenderov 03/11/2019


&НаСервереБезКонтекста
Функция ПолучитьПараметрыШтампа(Спецификация, НомерВарианта) //+Лико m.shenderov 15/12/2019
	Структура = Новый Структура;
	Структура.Вставить("ШтампВырубной");
	Структура.Вставить("ЭтикетокНаЛисте");
	Структура.Вставить("Нарезка");
	Структура.Вставить("Ручьи");
	Структура.Вставить("Z");
	// --> Начало Лико Митюшин МФМ 14.04.2021
	Структура.Вставить("РучьиПечати");
	Структура.Вставить("ЭтикетокНаЛистеПечати");
	// <-- Конец Лико Митюшин МФМ 14.04.2021
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Лико_Спецификации.ШтампВырубной КАК ШтампВырубной,
	|	Лико_Спецификации.ЭтикетокНаЛисте КАК ЭтикетокНаЛисте,
	|	Лико_Спецификации.Нарезка КАК Нарезка,
	|	Лико_Спецификации.Ручьи КАК Ручьи,
	|	Лико_Спецификации.Z КАК Z,
	|	Лико_Спецификации.РучьиПечати КАК РучьиПечати,
	|	Лико_Спецификации.ЭтикетокНаЛистеПечати КАК ЭтикетокНаЛистеПечати
	|ИЗ
	|	Справочник.Лико_Спецификации КАК Лико_Спецификации
	|ГДЕ
	|	Лико_Спецификации.Ссылка = &Спецификация";
	Запрос.УстановитьПараметр("Спецификация",Спецификация );
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл		
		ЗаполнитьЗначенияСвойств(Структура,Выборка);
	КонецЦикла; 
	
	Возврат Структура;
	
КонецФункции  //-Лико m.shenderov 15/12/2019




&НаКлиенте
Процедура ТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ЗаполнитьТаблицуТоварыДополнительнымиПолями();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьТаблицуТоварыДополнительнымиПолями();
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		
		//ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект, , ПараметрОбъектКопирования);
		
		//УстановитьНовыйНомер(Организация.Префикс);
		//Объект.Площадка = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
		
		Менеджер = ТекущийПользовательСервер();
		СтатусЗаявки = ПредопределенноеЗначение("Перечисление.Лико_СтатусыЗаявкиНаДизайн.Создана");
	Иначе
		СформироватьПодменюФорматаДляСкрипта();
		
		УстановитьДоступностьВидимостьЭлементовФормы();
		
		
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказКлиентаПриИзменении(Элемент)
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаказКлиентаПриИзмененииЗавершение", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, "Заполнить таблицу товары?",РежимДиалогаВопрос.ДаНет, 60);
	
	
	
КонецПроцедуры



Процедура ЗаполнитьПоЗаказуКлиента() //+Лико m.shenderov 04/11/2019
	Объект.ВидЗаказа = Объект.ЗаказКлиента.ВидЗаказа;
	Объект.Комментарий = Объект.ЗаказКлиента.Комментарий;
	Объект.Партнер = Объект.ЗаказКлиента.Партнер;
	Объект.Организация = Объект.ЗаказКлиента.Организация;
	Объект.Менеджер = Объект.ЗаказКлиента.Ответственный;
	Объект.Площадка = Объект.ЗаказКлиента.Площадка;
	
	Для Каждого ТекСтрокаТовары Из Объект.ЗаказКлиента.Товары Цикл
		НоваяСтрока = Объект.Товары.Добавить();
		НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
	КонецЦикла;
	
	
КонецПроцедуры //-Лико m.shenderov 04/11/2019



Процедура ЗаполнитьПоСпецификации() //+Лико m.shenderov 04/11/2019
	//Объект.ВидЗаказа = Объект.Спецификация.ВидЗаказа;
	Объект.Комментарий = Объект.Спецификация.Комментарий;
	Объект.Партнер = Объект.Спецификация.Партнер;
	//Объект.Организация = Объект.Спецификация.Организация;
	Объект.Менеджер = Объект.Спецификация.Менеджер;
	Объект.Площадка = Объект.Спецификация.Площадка;
	
	Для Каждого ТекСтрокаТовары Из Объект.Спецификация.Товары Цикл
		НоваяСтрока = Объект.Товары.Добавить();
		НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
		НоваяСтрока.Спецификация = Объект.Спецификация;
	КонецЦикла;
	
	
	
	
КонецПроцедуры //-Лико m.shenderov 04/11/2019






Функция ТекущийПользовательСервер() //+Лико m.shenderov 03/11/2019
	Возврат ПараметрыСеанса.ТекущийПользователь;
КонецФункции  //-Лико m.shenderov 03/11/2019

Процедура УстановитьДоступностьВидимостьЭлементовФормы()
	
	Если Не Документы.Лико_ЗаявкаНаДизайн.ЕстьГруппаДоступа("лк Бригадир",ПараметрыСеанса.ТекущийПользователь) Тогда
		
		Элементы.ДатаФактическогоЗакрытия.Видимость = Ложь;
		
		Если Объект.СтатусЗаявки=Перечисления.Лико_СтатусыЗаявкиНаДизайн.Закрыта Тогда
			ЭтаФорма.ТолькоПросмотр = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры //УстановитьДоступностьВидимостьЭлементовФормы

Процедура СформироватьПодменюФорматаДляСкрипта()
	Для каждого Эл Из  Элементы.ФорматДляСкрипта.ПодчиненныеЭлементы Цикл
		ИмяКоманды=Эл.Имя;
		Элементы.Удалить(Эл);
		Если Команды.Найти(ИмяКоманды)<>Неопределено Тогда
			Команды.Удалить(Команды.Найти(ИмяКоманды));
		КонецЕсли;
		
		
	КонецЦикла;
	Для Каждого СтрокаТовары Из Объект.Товары Цикл
		
		ПроверитьСоздатьПодменюФорматаДляСкрипта(СтрокаТовары.НомерСтроки);
		
	КонецЦикла;
	
	
	
	
	
КонецПроцедуры //СформироватьПодменюФорматаДляСкрипта

Процедура ПроверитьСоздатьПодменюФорматаДляСкрипта(НомерСтроки)
	
	ПрефиксИмени = "ФорматДляСкрипта";
	ИмяКнопки=ПрефиксИмени+НомерСтроки;
	
	Если Элементы.Найти(ИмяКнопки)=Неопределено Тогда
		
		// добавим саму кнопку монтажа
		
		КомандаФормы  = Команды.Добавить(ИмяКнопки);
		КомандаФормы.Действие = "ПодменюФорматДляСкриптаНажатие";
		Элементы.Добавить(ИмяКнопки,Тип("КнопкаФормы"), Элементы.ФорматДляСкрипта); 
		Элементы[ИмяКнопки].Заголовок = Строка(НомерСтроки)+Объект.Товары[НомерСтроки-1].Номенклатура;
		Элементы[ИмяКнопки].ИмяКоманды = ИмяКнопки;
		
		///Элементы.Переместить(Элементы[ИмяКнопки],ЭтаФорма.КоманднаяПанель,Элементы.ФорматДляСкрипта); 
	КонецЕсли;
	
КонецПроцедуры //ПроверитьСоздатьПодменюФорматаДляСкрипта

&НаКлиенте
Процедура ПодменюФорматДляСкриптаНажатие(Элемент)
	ПозицияПробела = СтрЗаменить(Элемент.Имя,"ФорматДляСкрипта","");
	НомерСтроки = Число(ПозицияПробела);
	Если НомерСтроки=0 Тогда
		Возврат;
	КонецЕсли;
	
	ВыводФорматаДляСкрипта(НомерСтроки);
	
КонецПроцедуры


&НаКлиенте
Процедура ВыводФорматаДляСкрипта(НомерСтроки)
	
	Отказ = Ложь;
	
	ТекущаяСтрока = Объект.Товары[НомерСтроки-1]; 
	
	ТекстСкрипта = СформироватьТекстДляСкриптаДизайн(Объект.Ссылка,ТекущаяСтрока.Номенклатура,НомерСтроки,ТекущаяСтрока.Спецификация,ТекущаяСтрока.НомерВарианта,Отказ);
	
	Если Отказ Тогда
		Сообщить("Не удалось сформировать формат для скрипта!",СтатусСообщения.Информация);
	Иначе
		ТекстДок = Новый ТекстовыйДокумент;
		ТекстДок.ДобавитьСтроку(ТекстСкрипта);
		
		ТекстДок.Показать();
	КонецЕсли;
	
КонецПроцедуры //ВыводФорматаДляСкрипта


Функция СформироватьТекстДляСкриптаДизайн(Ссылка,Номенклатура,НомерСтроки,Спецификация,НомерВарианта,Отказ) //+Лико m.shenderov 04/11/2019
		Возврат Документы.Лико_ЗаявкаНаДизайн.СформироватьТекстДляСкриптаДизайн(Ссылка,Номенклатура,НомерСтроки,Спецификация,НомерВарианта,Отказ)
КонецФункции //-Лико m.shenderov 04/11/2019 


//Вынести в отдельную процедуру
&НаКлиенте
Процедура ЗаказКлиентаПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Объект.Товары.Очистить();
		ЗаполнитьПоЗаказуКлиента(); 		
		ЗаполнитьТаблицуТоварыДополнительнымиПолями();
		
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура СпецификацияПриИзменении(Элемент)
	ОписаниеОповещения = Новый ОписаниеОповещения("СпецификацияПриИзмененииЗавершение", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, "Заполнить таблицу товары?",РежимДиалогаВопрос.ДаНет, 60);
	
КонецПроцедуры

//Вынести в отдельную процедуру
&НаКлиенте
Процедура СпецификацияПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Объект.Товары.Очистить();
		
		ЗаполнитьПоСпецификации(); 		
		ЗаполнитьТаблицуТоварыДополнительнымиПолями();
		
	КонецЕсли; 
КонецПроцедуры


&НаКлиенте
Процедура ТоварыСпецификацияПриИзменении(Элемент)
	
	Товар=Элементы.Товары.ТекущиеДанные;
	ЗаполнитьТаблицуТоварыДополнительнымиПолями();
	Товар.Номенклатура=НайтиНоменклатуруПоСпецификацииНаСервере(Товар.Спецификация);
	Если КоличествоНоменклатурВСпецификации(Товар.Спецификация)>1 Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("РедактированиеСпецификацииЗавершение", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, "Добавить всю номенклатуру из спецификации?",РежимДиалогаВопрос.ДаНет, 60);
		
	КонецЕсли;
	
РедактированиеСтрокиСпецификации=Истина;	

ЭтаФорма.ТекущийЭлемент = Элементы.ТоварыСпецификация;
	
	
	
КонецПроцедуры

//Вынести в отдельную процедуру
&НаКлиенте
Процедура РедактированиеСпецификацииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ТекСтрока=Элементы.Товары.ТекущиеДанные;
		СтрСпецификация=ТекСтрока.Спецификация;
		НоменклатураПоспецификации=НоменклатураПоСпецификацииСервер(СтрСпецификация);
		н=1;
		Для каждого СтрНоменклатура Из НоменклатураПоспецификации Цикл
			Если н=1  Тогда
				н=2;
				
				ТекСтрока.Номенклатура=СтрНоменклатура;
			Иначе
				НоваяСтрока=Объект.Товары.Добавить();
				НоваяСтрока.Спецификация=СтрСпецификация;
				НоваяСтрока.Номенклатура=СтрНоменклатура;
			КонецЕсли;				
		КонецЦикла;		
	ЗаполнитьТаблицуТоварыДополнительнымиПолями();
	
	КонецЕсли; 
	
КонецПроцедуры


&НаСервере
Функция НоменклатураПоСпецификацииСервер (Спецификация) //+Лико m.shenderov 17/01/2020  
	Возврат Спецификация.Товары.Выгрузить().ВыгрузитьКолонку("Номенклатура");
КонецФункции  //-Лико m.shenderov 17/01/2020







&НаСервере
Функция НайтиНоменклатуруПоСпецификацииНаСервере(Спецификация) //+Лико m.shenderov 12/01/2020
	
	Возврат          ?(Спецификация.Товары.Количество()=1,Спецификация.Товары[0].Номенклатура,Неопределено);
	
	
КонецФункции  //-Лико m.shenderov 12/01/2020

Функция КоличествоНоменклатурВСпецификации(СтрСпецификация) //+Лико m.shenderov 17/01/2020
	
	Возврат СтрСпецификация.Товары.Количество();
	
КонецФункции //-Лико m.shenderov 17/01/2020






&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ЗаполнитьТаблицуТоварыДополнительнымиПолями();
	СформироватьПодменюФорматаДляСкрипта();
	
	
КонецПроцедуры


&НаКлиенте
Процедура ТоварыНоменклатураСоздание(Элемент, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Сообщить("Сначала необходимо записать заявку!");
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	индексстроки =  ТекущиеДанные.НомерСтроки - 1;
	Наименование = Элемент.ТекстРедактирования;
	Список = Новый СписокЗначений;
	Список.Добавить(ПредопределенноеЗначение("Перечисление.Лико_ТипыЭтикеток.ЭТ"));
	Список.Добавить(ПредопределенноеЗначение("Перечисление.Лико_ТипыЭтикеток.КЭ"));
	Список.Добавить(ПредопределенноеЗначение("Перечисление.Лико_ТипыЭтикеток.Кльр"));
	ДопПараметры = Новый Структура("ТекущиеДанные, Элемент, Текст", ТекущиеДанные, Элемент, Наименование); 
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораТипаЭтикетки", ЭтотОбъект, ДопПараметры);
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Выберите тип создаваемого товара (эт, контр или колье)";
	Сообщение.Сообщить();
	ПоказатьВыборИзСписка(ОписаниеОповещения, Список );
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораТипаЭтикетки(Знач ВыбранныйЭлемент, ДопПараметры) Экспорт
	Если ВыбранныйЭлемент <> Неопределено Тогда    
		типЭтикетки = ВыбранныйЭлемент.Значение;
		Номенклатура = СоздатьНоменклатуруНаСервере(ДопПараметры.Текст, типэтикетки);
		ДопПараметры.ТекущиеДанные.Номенклатура = Номенклатура;
	КонецЕсли; 		
	
КонецПроцедуры

Функция СоздатьНоменклатуруНаСервере (Текст, ТипЭтикетки)
	НоваяНоменклатура = Лико_Планирование.СоздатьНоменклатуруНаСервере (Текст, ТипЭтикетки, Объект.Регион, Объект.Партнер);	
	Возврат НоваяНоменклатура;		
КонецФункции

//+Лико o.pukhova 07/02/2020
&НаКлиенте
Процедура ТоварыНомерВариантаРегулирование(Элемент, Направление, СтандартнаяОбработка)
	СтрокаТЧ = Элементы.Товары.ТекущиеДанные;
	// <-- Начало Лико Яцун С. В. 12.09.2024
	//В спецификациях отменено разделение по вариантам
	//Элемент.МаксимальноеЗначение = ПолучитьКоличествоВариантовСпецификации(СтрокаТЧ.Спецификация); 
	Элемент.МаксимальноеЗначение = 1;
	// <-- Конец Лико Яцун С. В. 12.09.2024
	Элемент.МинимальноеЗначение = 1;

КонецПроцедуры




//-Лико o.pukhova 07/02/2020
